andrew867/dashcdg/platform/espidf/projects/dashcdg_badge/sdkconfig.defaults
# Freenove ESP32 CYD-class boards: ESP32 (not S2/S3/C3), 4 MB flash typical.
CONFIG_IDF_TARGET="esp32"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Dual OTA slots (A/B) on 4 MB flash — see partitions_ota_4mb.csv
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota_4mb.csv"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# UART console (115200 is ESP-IDF default)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
